---
kind: type
id: T:Autodesk.Revit.DB.Electrical.LightingDevice
source: html/3847dea6-7a22-64f2-14c4-722ad4956e23.htm
---
# Autodesk.Revit.DB.Electrical.LightingDevice

Provides access to the Lighting Device in Autodesk Revit MEP.

## Syntax (C#)
```csharp
public class LightingDevice : MEPModel
```

## Remarks
The Lighting Device object can only be queried in Autodesk Revit MEP.